renesas/rx-driver-package/source/r_sci_iic_rx/r_sci_iic_rx_vx.xx/r_sci_iic_rx/src/targets/rx671/r_sci_iic_rx671.c
    #if SCI_IIC_CFG_CH6_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic6_txi_isr
 * Description  : Interrupt TXI handler for channel 6.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic6_txi_isr, VECT_SCI6_TXI6)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic6_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH6);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH6]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic6_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH7_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic7_txi_isr
 * Description  : Interrupt TXI handler for channel 7.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic7_txi_isr, VECT_SCI7_TXI7)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic7_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH7);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH7]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic7_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH8_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic8_txi_isr
 * Description  : Interrupt TXI handler for channel 8.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic8_txi_isr, VECT_SCI8_TXI8)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic8_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH8);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH8]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic8_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH9_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic9_txi_isr
 * Description  : Interrupt TXI handler for channel 9.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic9_txi_isr, VECT_SCI9_TXI9)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic9_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH9);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH9]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic9_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH10_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic10_txi_isr
 * Description  : Interrupt TXI handler for channel 10.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic10_txi_isr, VECT_SCI10_TXI10)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic10_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH10);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH10]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic10_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH11_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic11_txi_isr
 * Description  : Interrupt TXI handler for channel 11.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic11_txi_isr, VECT_SCI11_TXI11)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic11_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH11);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH11]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic11_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH12_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic12_txi_isr
 * Description  : Interrupt TXI handler for channel 12.
 *                Types of interrupt requests transmission end.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
R_BSP_PRAGMA_STATIC_INTERRUPT(sci_iic_int_sci_iic12_txi_isr, VECT_SCI12_TXI12)
R_BSP_ATTRIB_STATIC_INTERRUPT void sci_iic_int_sci_iic12_txi_isr (void)
{
    r_sci_iic_txi_isr_processing(SCI_IIC_NUM_CH12);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH12]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic12_txi_isr() */
    #endif

    #if SCI_IIC_CFG_CH0_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic0_tei_isr
 * Description  : Interrupt TEI handler for channel 0.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void sci_iic_int_sci_iic0_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH0);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH0]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic0_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH1_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic1_tei_isr
 * Description  : Interrupt TEI handler for channel 1.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void sci_iic_int_sci_iic1_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH1);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH1]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic1_tei_isr() */
    #endif

    #if SCI_IIC_CFG_CH2_INCLUDED
/***********************************************************************************************************************
 * Function Name: sci_iic_int_sci_iic2_tei_isr
 * Description  : Interrupt TEI handler for channel 2.
 *                Types of interrupt requests transfer error or event generation.
 *              : The event generations are arbitration-lost, NACK detection, timeout detection, 
 *              : start condition detection, and stop condition detection.
 * Arguments    : None
 * Return Value : None
 **********************************************************************************************************************/
void sci_iic_int_sci_iic2_tei_isr (void)
{
    r_sci_iic_tei_isr_processing(SCI_IIC_NUM_CH2);

    /* Calls advance function */
    r_sci_iic_advance(g_sci_iic_handles[SCI_IIC_NUM_CH2]->psci_iic_info_ch);
} /* End of function sci_iic_int_sci_iic2_tei_isr() */
    #endif

